#include <iostream>

int main() {
    std::cout << "Editor for cards v.0.1" << std::endl;
    /*
    колода == файл
    карта == запись в файле
    Начало работы -> выбор колоды -> выбор карты -> редактирование карты -> сохранение колоды -> закрытие колоды -> выбор колоды или выход
    TO DO:
    1. Написать классы для колоды и карты
    2. Чтение из файлов, запись в классы карт
    3. Отображение в GUI
    */
    return 0;
}